In [ ]:
import pyspark

In [11]:
import pandas as pd
df_pd = pd.read_csv('tset.csv')

In [12]:
df_pd

      Name  Age  Roll_no.
0   Gaurav   26        25
1    Swami   25        12
2      Dep   22        13
3    Sunny   23        15
4  Bhawesh   32        18

In [13]:
type(df_pd)

pandas.core.frame.DataFrame

In [15]:
df_pd.head(3)

     Name  Age  Roll_no.
0  Gaurav   26        25
1   Swami   25        12
2     Dep   22        13

In [16]:
df_pd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      5 non-null      object
 1   Age       5 non-null      int64
 2   Roll_no.  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes